Day2_commented.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Day 2 - Commented History from Class</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-05-14 18:55:18 "/>
<meta name="author" content="Cari Bogulski, Jason Gullifer"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>
<div id="content">

<h1 class="title">Day 2 - Commented History from Class</h1>



<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Working with data.frame </a>
<ul>
<li><a href="#sec-1.1">1.1 Load our heights data and get the dimensions </a></li>
<li><a href="#sec-1.2">1.2 Referencing a data.frame by row and column number </a></li>
<li><a href="#sec-1.3">1.3 Referencing a data.frame by column name </a></li>
<li><a href="#sec-1.4">1.4 Adding new columns to data.frame </a>
<ul>
<li><a href="#sec-1.4.1">1.4.1 cbind() adding </a></li>
<li><a href="#sec-1.4.2">1.4.2 $ adding </a></li>
</ul>
</li>
<li><a href="#sec-1.5">1.5 Summarizing elements of a data.frame data </a></li>
<li><a href="#sec-1.6">1.6 Filtering or subsetting data.frame </a></li>
</ul>
</li>
<li><a href="#sec-2">2 Misc Stuff </a>
<ul>
<li><a href="#sec-2.1">2.1 NA Values </a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Working with data.frame </h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1.1" class="outline-3">
<h3 id="sec-1.1"><span class="section-number-3">1.1</span> Load our heights data and get the dimensions </h3>
<div class="outline-text-3" id="text-1.1">

<p>Let's load our heights data using <code>read.csv</code>. Then we should check the
dimensions of it, and check each of the columns to see what type of
data they contain. We might also want to see the <code>head</code> of our data;
by default it shows 6 rows but we can customize how many rows we want
to see.
</p>


<pre class="example">heights = read.csv("height_data.csv")
dim(heights)
str(heights)
head(heights)
head(heights,2)
</pre>








<p>
Note: <code>dim()</code> only really works on multi-dimensional objects like
data.frames. Otherwise NULL is returned.
</p>


<pre class="example">x = 7
dim(x)
y = 5
xy = c(x,y)
dim(xy)
</pre>






</div>

</div>

<div id="outline-container-1.2" class="outline-3">
<h3 id="sec-1.2"><span class="section-number-3">1.2</span> Referencing a data.frame by row and column number </h3>
<div class="outline-text-3" id="text-1.2">





<pre class="example">heights[1,3]
heights[7,1]
heights[4,2]
</pre>





<pre class="example">heights[1:10,2]
heights[1:10,1:3]
heights[1:10,c(1,3)]
</pre>




</div>

</div>

<div id="outline-container-1.3" class="outline-3">
<h3 id="sec-1.3"><span class="section-number-3">1.3</span> Referencing a data.frame by column name </h3>
<div class="outline-text-3" id="text-1.3">




<pre class="example">heights$Height
heights$Name
heights$Gender
</pre>





<p>
We can also ask for a specific element of a column name. Note: to do
this, you're now referencing a vector, so the ',' isn't necessary and
its inclusion would cause an error.
</p>


<pre class="example">height$Heights[5]
height$Heights[5,2]
</pre>




<p>
We might want to check the length of a column vector as well
</p>


<pre class="example">length(heights$Height)
</pre>




</div>

</div>

<div id="outline-container-1.4" class="outline-3">
<h3 id="sec-1.4"><span class="section-number-3">1.4</span> Adding new columns to data.frame </h3>
<div class="outline-text-3" id="text-1.4">

<p>Two basic ways. Through <code>$</code> notation and through <code>cbind()</code> (or column bind).
</p>

</div>

<div id="outline-container-1.4.1" class="outline-4">
<h4 id="sec-1.4.1"><span class="section-number-4">1.4.1</span> cbind() adding </h4>
<div class="outline-text-4" id="text-1.4.1">




<pre class="example">pets_height = c(12,9,8,0,25,24,7,0,0,0)
new_data = cbind(heights,pets_height)
new_data

joint_height = new_data$Height+new_data$pets_height
new_new_data = cbind(new_data,joint_height)
new_data
</pre>




</div>

</div>

<div id="outline-container-1.4.2" class="outline-4">
<h4 id="sec-1.4.2"><span class="section-number-4">1.4.2</span> $ adding </h4>
<div class="outline-text-4" id="text-1.4.2">




<pre class="example">pets_height = c(12,9,8,0,25,24,7,0,0,0)
new_data = heights
new_data$pets_height &lt;- pets_height
new_new_data &lt;- new_data
new_new_data$joint_height &lt;- new_new_data$Height + new_new_data$pets_height
</pre>




</div>
</div>

</div>

<div id="outline-container-1.5" class="outline-3">
<h3 id="sec-1.5"><span class="section-number-3">1.5</span> Summarizing elements of a data.frame data </h3>
<div class="outline-text-3" id="text-1.5">




<pre class="example">all_heights_mean &lt;- mean(heights$Height)
allheights_median &lt;- median(heights$Height)
sums_heights &lt;- sum(heights$Height)
</pre>





<p>
If you try to run a function on an entire data.frame you will probably
get weird results. E.g., you can't get the mean of character/factor
vectors.
</p>



<pre class="example">mean(heights)
</pre>




</div>

</div>

<div id="outline-container-1.6" class="outline-3">
<h3 id="sec-1.6"><span class="section-number-3">1.6</span> Filtering or subsetting data.frame </h3>
<div class="outline-text-3" id="text-1.6">




<pre class="example">data = new_data[,1:4]
petowner_data = data[data$pets_height&gt;0]
petowner_data = data[data$pets_height&gt;0,]

</pre>





<pre class="example">data$pets_height&gt;0
</pre>





<pre class="example">tall_petowner_data = data[data$pets_height &gt; 0 &amp; data$Height &gt; mean(data$Height) , ]
tall_petowner_data

short_petowner_data = data[data$pets_height &gt; 0 &amp; data$Height &lt; mean(data$Height) , ]
short_petowner_data

tall_petowner_data = data[data$pets_height &gt; 0 &amp; data$Height &gt;= mean(data$Height) , ]
tall_petowner_data

nonpetowners = data[data$pets_height==0,]
nonpetowners
</pre>




<p>
Alternative way of making non-petowners data set.
</p>


<pre class="example">nonpetowners = data[!(data$pets_height&gt;0),]
</pre>





</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Misc Stuff </h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2.1" class="outline-3">
<h3 id="sec-2.1"><span class="section-number-3">2.1</span> NA Values </h3>
<div class="outline-text-3" id="text-2.1">


<p>
Instead of having 0's in <code>pets_height</code> we could have used NA
values. NA values can be completely ignored by many summary functions
such as <code>mean</code> and <code>sum</code>. However, if you do not ignore them, R will
return your summary data as <code>NA</code> to make you aware that your data
included NA values.
</p>


<pre class="example">pets_height = c(12,9,8,NA,25,24,7,NA,NA,NA)
mean(pets_height)
mean(pets_height,na.rm=TRUE)
</pre>




<p>
You can check for NAs in your data with the <code>is.na()</code> function
</p>


<pre class="example">is.na(pets_height)
</pre>



</div>
</div>
</div>
<div id="postamble">
<p class="author"> Author: Cari Bogulski, Jason Gullifer
<a href="mailto:cari.bogulski@gmail.com">&lt;cari.bogulski@gmail.com&gt;</a>
<a href="mailto:jason.gullifer@gmail.com">&lt;jason.gullifer@gmail.com&gt;</a>
</p>
<p class="date"> Date: 2013-05-14 18:55:18 </p>
<p class="creator">HTML generated by org-mode 6.33x in emacs 23</p>
</div>
</div>
</body>
</html>
